Revit 2027 API
StructuralConnectionHandlerType.IsDetailed Method
 Checks if StructuralConnectionHandlerType is detailed.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDetailed()
Public Function IsDetailed As Boolean
public:
bool IsDetailed()
member IsDetailed : unit -> bool
Return Value
Boolean
 True if StructuralConnectionHandlerType is detailed.
See Also
Reference
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace